ERP/src/InformationRegisters/ФайлыИзОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФайлыИзОбращений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НазваниеФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбращениеВПоддержку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСообщения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдСообщенияВПоддержку</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/InformationRegisters/ФайлыИзОбращений/Ext/ManagerModule.bsl
Процедура ЗаписатьФайлВБазу(ОбъектЗаписи, ДанныеФайла, РасширениеФайла, РазмерФайла) Экспорт
	АлгоритмСжатия = Новый СжатиеДанных(9);
	
	ХранилищеСФайлом = Новый ХранилищеЗначения(ДанныеФайла, АлгоритмСжатия);
	
	ЗаписьФайла = СоздатьМенеджерЗаписи();
	ЗаписьФайла.Объект = ОбъектЗаписи;
	ЗаписьФайла.ДанныеФайла = ХранилищеСФайлом;
	ЗаписьФайла.Расширение = РасширениеФайла;
    ЗаписьФайла.РазмерФайла = РазмерФайла;
	
	ЗаписьФайла.Записать(Истина);
КонецПроцедуры

Функция ПолучитьДанныеФайла(ОбъектЧтения) Экспорт
	ЧтениеФайла = СоздатьМенеджерЗаписи();
 	ЧтениеФайла.Объект = ОбъектЧтения;
	ЧтениеФайла.Прочитать();
	
	ДанныеФайла = ЧтениеФайла.ДанныеФайла.Получить();
	
	Возврат ДанныеФайла;
КонецФункции
